Revit 2024 API
IExportContext.OnLinkEnd Method
 This method marks the end of a link instance being exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
void OnLinkEnd(
	LinkNode node
)
Visual Basic
Sub OnLinkEnd ( _
	node As LinkNode _
)
Visual C++
void OnLinkEnd(
	LinkNode^ node
)
Parameters
node
Type: Autodesk.Revit.DB.LinkNode
 An output node that represents a Revit link.
See Also
IExportContext Interface
Autodesk.Revit.DB Namespace